{"recipes":[  {    "recipe_name": "Cheesy Stuffed Potatoes",    "description": "These Cheesy Stuffed Potatoes are a delicious and satisfying side dish or appetizer. The potatoes are baked until tender, then filled with a mixture of melted cheese and sautéed vegetables. It's a cheesy and flavorful dish that everyone will love!",    "ingredients": {      "potatoes": "4 medium-sized",      "butter": "4 tablespoons, melted",      "cheddar_cheese": "1 cup, shredded",      "green_pepper": "1, diced",      "red_pepper": "1, diced",      "salt": "1/2 teaspoon",      "black_pepper": "1/4 teaspoon"    },    "instructions": [      {        "step_number": 1,        "description": "Prepare the Potatoes:",        "sub_steps": [          "Preheat the oven to 400°F (200°C).",          "Wash and scrub the potatoes to remove any dirt.",          "Prick the potatoes all over with a fork.",          "Place the potatoes on a baking sheet and brush with melted butter.",          "Bake the potatoes for 45-55 minutes, or until they are cooked through and tender when pierced with a fork."        ]      },      {        "step_number": 2,        "description": "Make the Filling:",        "sub_steps": [          "While the potatoes are baking, heat 1 tablespoon of melted butter in a skillet over medium heat.",          "Add the diced green and red peppers to the skillet and sauté until they are softened.",          "In a separate bowl, combine the shredded cheddar cheese, sautéed peppers, salt, and black pepper. Mix well.",          "Once the potatoes are cooked, remove them from the oven and let them cool slightly."        ]      },      {        "step_number": 3,        "description": "Stuff the Potatoes:",        "sub_steps": [          "Cut a slit lengthwise in each potato, being careful not to cut all the way through.",          "Gently push the ends of the potato towards the center to open up the slit.",          "Divide the cheese and pepper mixture evenly among the potatoes, filling the slit.",          "Return the stuffed potatoes to the oven and bake for an additional 5-10 minutes, or until the cheese is melted and bubbly."        ]      },      {        "step_number": 4,        "description": "Serve:",        "sub_steps": [          "Remove the stuffed potatoes from the oven and let them cool slightly.",          "Serve hot as a side dish or appetizer.",          "Enjoy your delicious Cheesy Stuffed Potatoes!"        ]      }    ]  },  {    "recipe_name": "Classic Breakfast Sandwich",    "description": "This Classic Breakfast Sandwich is a simple and satisfying way to start your day. It features fluffy scrambled eggs, melted cheese, and crispy bacon or sausage, all sandwiched between two slices of toasted bread. It's a delicious and portable breakfast option that's perfect for busy mornings.",    "ingredients": {      "bread_slices": "4",      "eggs": "4",      "cheddar_cheese": "4 slices",      "bacon_or_sausage": "4 slices, cooked",      "butter": "2 tablespoons, softened",      "optional_additions": "sliced tomato, avocado"    },    "instructions": [      {        "step_number": 1,        "description": "Cook the Eggs:",        "sub_steps": [          "In a bowl, whisk the eggs until well beaten.",          "Heat a skillet over medium heat and melt 1 tablespoon of butter.",          "Pour the beaten eggs into the skillet and cook, stirring occasionally, until they are scrambled and cooked to your desired consistency.",          "Remove the skillet from heat and set aside."        ]      },      {        "step_number": 2,        "description": "Assemble the Sandwiches:",        "sub_steps": [          "Spread one side of each bread slice with softened butter.",          "Place a slice of cheddar cheese on the unbuttered side of 2 bread slices.",          "If using any optional additions like sliced tomato or avocado, layer them on top of the cheese slices.",          "Top each sandwich with cooked bacon or sausage slices.",          "Cover the sandwiches with the remaining bread slices, buttered side facing out."        ]      },      {        "step_number": 3,        "description": "Toast the Sandwiches:",        "sub_steps": [          "Heat a skillet or griddle over medium heat.",          "Place the assembled sandwiches in the skillet and cook until the bread is toasted and the cheese is melted, about 2-3 minutes per side.",          "Remove the sandwiches from the skillet and let them cool for a minute."        ]      },      {        "step_number": 4,        "description": "Serve:",        "sub_steps": [          "Cut the sandwiches in half diagonally, if desired, and serve hot.",          "Enjoy your delicious Classic Breakfast Sandwich!"        ]      }    ]  },  {    "recipe_name": "Biscuit Breakfast Casserole",    "description": "This Biscuit Breakfast Casserole is a hearty and satisfying breakfast dish that's perfect for feeding a crowd. It features flaky biscuits, scrambled eggs, melted cheese, and your choice of breakfast meats like bacon, sausage, ham, or a combination. It's a delicious and comforting casserole that will leave everyone asking for seconds!",    "ingredients": {      "biscuits": "8",      "eggs": "6",      "cheddar_cheese": "1 cup, shredded",      "bacon_or_sausage_or_ham": "8 slices, cooked and crumbled",      "milk": "1/2 cup",      "salt": "1/2 teaspoon",      "black_pepper": "1/4 teaspoon",      "optional_additions": "sliced green onions, diced bell peppers"    },    "instructions": [      {        "step_number": 1,        "description": "Prepare the Biscuits:",        "sub_steps": [          "Preheat the oven to 375°F (190°C).",          "Cut the biscuits into small pieces.",          "Place the biscuit pieces in a greased 9x13-inch baking dish."        ]      },      {        "step_number": 2,        "description": "Layer the Casserole:",        "sub_steps": [          "In a bowl, whisk the eggs together with the milk, salt, and black pepper.",          "Pour the egg mixture over the biscuit pieces in the baking dish.",          "Sprinkle the shredded cheese, crumbled bacon or sausage or ham, and any optional additions evenly over the top.",          "Gently press down on the ingredients to ensure they are nestled into the biscuits and eggs."        ]      },      {        "step_number": 3,        "description": "Bake the Casserole:",        "sub_steps": [          "Place the baking dish in the preheated oven and bake for 25-30 minutes, or until the casserole is golden brown and set in the center.",          "Remove the casserole from the oven and let it cool for a few minutes before serving."        ]      },      {        "step_number": 4,        "description": "Serve:",        "sub_steps": [          "Cut the Biscuit Breakfast Casserole into squares or rectangles, and serve hot.",          "Enjoy your delicious Biscuit Breakfast Casserole!"        ]      }    ]  }]}